### Terraform Plan Output
```
[command]/home/runner/work/_temp/75ebffc4-1b8e-46c2-a720-7db9c0faaf1f/terraform-bin plan -no-color -var git_branch=30/merge -var environment=uat -var filepath=base-eng-fxn-bucket
2024-05-28T08:21:53.890Z [INFO]  Terraform version: 1.5.3
2024-05-28T08:21:53.890Z [INFO]  Go runtime version: go1.20
2024-05-28T08:21:53.890Z [INFO]  CLI args: []string{"/home/runner/work/_temp/75ebffc4-1b8e-46c2-a720-7db9c0faaf1f/terraform-bin", "plan", "-no-color", "-var", "git_branch=30/merge", "-var", "environment=uat", "-var", "filepath=base-eng-fxn-bucket"}
2024-05-28T08:21:53.890Z [INFO]  CLI command args: []string{"plan", "-no-color", "-var", "git_branch=30/merge", "-var", "environment=uat", "-var", "filepath=base-eng-fxn-bucket"}
2024-05-28T08:21:53.895Z [INFO]  AWS Auth provider used: "EnvProvider"
2024-05-28T08:21:55.092Z [INFO]  backend/local: starting Plan operation
2024-05-28T08:21:55.703Z [INFO]  provider: configuring client automatic mTLS
2024-05-28T08:21:55.814Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-28T08:21:55.814Z
2024-05-28T08:21:56.494Z [INFO]  provider: configuring client automatic mTLS
2024-05-28T08:21:56.588Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-28T08:21:56.588Z
2024-05-28T08:21:57.268Z [INFO]  backend/local: plan calling Plan
2024-05-28T08:21:57.274Z [INFO]  provider: configuring client automatic mTLS
2024-05-28T08:21:57.359Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-28T08:21:57.359Z
2024-05-28T08:21:57.970Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved credentials: tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=3e056492-87bc-2ba9-fe41-3bc16db39455 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-05-28T08:21:57.970Z
2024-05-28T08:21:58.316Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_req_id=3e056492-87bc-2ba9-fe41-3bc16db39455 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-05-28T08:21:58.316Z
2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.322Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.api_gateway, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
2024-05-28T08:21:58.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
2024-05-28T08:21:58.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_api.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .route_selection_expression: planned value cty.StringVal("$request.method $request.path") for a non-computed attribute
      - .api_key_selection_expression: planned value cty.StringVal("$request.header.x-api-key") for a non-computed attribute
2024-05-28T08:21:58.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.event_handler_execution_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.architectures"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.timeout"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.git_branch"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.package_type"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.runtime"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.filepath"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.function_handler"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.publish"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.log_level"
2024-05-28T08:21:58.325Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.326Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"
2024-05-28T08:21:58.326Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.332Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-28T08:21:58.332Z [INFO]  ReferenceTransformer: reference not found: "var.environment"
2024-05-28T08:21:58.335Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_integration.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .payload_format_version: planned value cty.StringVal("1.0") for a non-computed attribute
2024-05-28T08:21:58.337Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_route.event_handler, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .api_key_required: planned value cty.False for a non-computed attribute
      - .authorization_type: planned value cty.StringVal("NONE") for a non-computed attribute
2024-05-28T08:21:58.349Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.event_handler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "event_handler" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "EventHandlerPolicy"
        }
    }

  # aws_apigatewayv2_api.event_handler will be created
  + resource "aws_apigatewayv2_api" "event_handler" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "event-handler-uat"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.event_handler will be created
  + resource "aws_apigatewayv2_integration" "event_handler" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.event_handler will be created
  + resource "aws_apigatewayv2_route" "event_handler" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /event-handler"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.event_handler will be created
  + resource "aws_apigatewayv2_stage" "event_handler" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "uat"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + responseLength = "$context.responseLength"
                  + routeKey       = "$context.routeKey"
                  + status         = "$context.status"
                }
            )
        }
    }

  # aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/api-gateway/event_handler-uat"
      + name_prefix       = (known after apply)
      + retention_in_days = 60
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.event_handler will be created
  + resource "aws_cloudwatch_log_group" "event_handler" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/chatting_api_uat"
      + name_prefix       = (known after apply)
      + retention_in_days = 60
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_iam_role.event_handler_execution_role will be created
  + resource "aws_iam_role" "event_handler_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "event_handler_execution_role_uat"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.event_handler will be created
  + resource "aws_iam_role_policy" "event_handler" {
      + id          = (known after apply)
      + name        = "chatting_api_uat"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lambda_function.event_handler will be created
  + resource "aws_lambda_function" "event_handler" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "chatting_api_uat"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + s3_bucket                      = "base-eng-fxn-bucket"
      + s3_key                         = "uat/30/merge-function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_LEVEL"               = "INFO"
              + "POWERTOOLS_SERVICE_NAME" = "chatting_api_uat"
            }
        }
    }

  # aws_lambda_permission.event_handler will be created
  + resource "aws_lambda_permission" "event_handler" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "chatting_api_uat"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.event_handler will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "event_handler" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "logs:CreateLogStream",%0A              + "logs:PutLogEvents",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "EventHandlerPolicy"%0A        }%0A    }%0A%0A  # aws_apigatewayv2_api.event_handler will be created%0A  + resource "aws_apigatewayv2_api" "event_handler" {%0A      + api_endpoint                 = (known after apply)%0A      + api_key_selection_expression = "$request.header.x-api-key"%0A      + arn                          = (known after apply)%0A      + execution_arn                = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "event-handler-uat"%0A      + protocol_type                = "HTTP"%0A      + route_selection_expression   = "$request.method $request.path"%0A      + tags_all                     = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_integration.event_handler will be created%0A  + resource "aws_apigatewayv2_integration" "event_handler" {%0A      + api_id                                    = (known after apply)%0A      + connection_type                           = "INTERNET"%0A      + id                                        = (known after apply)%0A      + integration_method                        = "POST"%0A      + integration_response_selection_expression = (known after apply)%0A      + integration_type                          = "AWS_PROXY"%0A      + integration_uri                           = (known after apply)%0A      + payload_format_version                    = "1.0"%0A      + timeout_milliseconds                      = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_route.event_handler will be created%0A  + resource "aws_apigatewayv2_route" "event_handler" {%0A      + api_id             = (known after apply)%0A      + api_key_required   = false%0A      + authorization_type = "NONE"%0A      + id                 = (known after apply)%0A      + route_key          = "POST /event-handler"%0A      + target             = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_stage.event_handler will be created%0A  + resource "aws_apigatewayv2_stage" "event_handler" {%0A      + api_id        = (known after apply)%0A      + arn           = (known after apply)%0A      + auto_deploy   = true%0A      + deployment_id = (known after apply)%0A      + execution_arn = (known after apply)%0A      + id            = (known after apply)%0A      + invoke_url    = (known after apply)%0A      + name          = "uat"%0A      + tags_all      = (known after apply)%0A%0A      + access_log_settings {%0A          + destination_arn = (known after apply)%0A          + format          = jsonencode(%0A                {%0A                  + httpMethod     = "$context.httpMethod"%0A                  + ip             = "$context.identity.sourceIp"%0A                  + protocol       = "$context.protocol"%0A                  + requestId      = "$context.requestId"%0A                  + requestTime    = "$context.requestTime"%0A                  + responseLength = "$context.responseLength"%0A                  + routeKey       = "$context.routeKey"%0A                  + status         = "$context.status"%0A                }%0A            )%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_group.api_gateway will be created%0A  + resource "aws_cloudwatch_log_group" "api_gateway" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/api-gateway/event_handler-uat"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 60%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_log_group.event_handler will be created%0A  + resource "aws_cloudwatch_log_group" "event_handler" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/lambda/chatting_api_uat"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 60%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # aws_iam_role.event_handler_execution_role will be created%0A  + resource "aws_iam_role" "event_handler_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "event_handler_execution_role_uat"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/service-role/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.event_handler will be created%0A  + resource "aws_iam_role_policy" "event_handler" {%0A      + id          = (known after apply)%0A      + name        = "chatting_api_uat"%0A      + name_prefix = (known after apply)%0A      + policy      = (known after apply)%0A      + role        = (known after apply)%0A    }%0A%0A  # aws_lambda_function.event_handler will be created%0A  + resource "aws_lambda_function" "event_handler" {%0A      + architectures                  = [%0A          + "x86_64",%0A        ]%0A      + arn                            = (known after apply)%0A      + code_sha256                    = (known after apply)%0A      + function_name                  = "chatting_api_uat"%0A      + handler                        = "main.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = true%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = (known after apply)%0A      + runtime                        = "python3.10"%0A      + s3_bucket                      = "base-eng-fxn-bucket"%0A      + s3_key                         = "uat/30/merge-function.zip"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = (known after apply)%0A      + source_code_size               = (known after apply)%0A      + tags_all                       = (known after apply)%0A      + timeout                        = 30%0A      + version                        = (known after apply)%0A%0A      + environment {%0A          + variables = {%0A              + "LOG_LEVEL"               = "INFO"%0A              + "POWERTOOLS_SERVICE_NAME" = "chatting_api_uat"%0A            }%0A        }%0A    }%0A%0A  # aws_lambda_permission.event_handler will be created%0A  + resource "aws_lambda_permission" "event_handler" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "chatting_api_uat"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = "AllowExecutionFromAPIGateway"%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + api_endpoint = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-28T08:21:53.890Z [INFO]  Terraform version: 1.5.3%0A2024-05-28T08:21:53.890Z [INFO]  Go runtime version: go1.20%0A2024-05-28T08:21:53.890Z [INFO]  CLI args: []string{"/home/runner/work/_temp/75ebffc4-1b8e-46c2-a720-7db9c0faaf1f/terraform-bin", "plan", "-no-color", "-var", "git_branch=30/merge", "-var", "environment=uat", "-var", "filepath=base-eng-fxn-bucket"}%0A2024-05-28T08:21:53.890Z [INFO]  CLI command args: []string{"plan", "-no-color", "-var", "git_branch=30/merge", "-var", "environment=uat", "-var", "filepath=base-eng-fxn-bucket"}%0A2024-05-28T08:21:53.895Z [INFO]  AWS Auth provider used: "EnvProvider"%0A2024-05-28T08:21:55.092Z [INFO]  backend/local: starting Plan operation%0A2024-05-28T08:21:55.703Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-28T08:21:55.814Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-28T08:21:55.814Z%0A2024-05-28T08:21:56.494Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-28T08:21:56.588Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-28T08:21:56.588Z%0A2024-05-28T08:21:57.268Z [INFO]  backend/local: plan calling Plan%0A2024-05-28T08:21:57.274Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-28T08:21:57.359Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: configuring server automatic mTLS: timestamp=2024-05-28T08:21:57.359Z%0A2024-05-28T08:21:57.970Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved credentials: tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=3e056492-87bc-2ba9-fe41-3bc16db39455 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-05-28T08:21:57.970Z%0A2024-05-28T08:21:58.316Z [INFO]  provider.terraform-provider-aws_v5.51.1_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_req_id=3e056492-87bc-2ba9-fe41-3bc16db39455 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-05-28T08:21:58.316Z%0A2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-28T08:21:58.318Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.322Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.api_gateway, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A2024-05-28T08:21:58.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A2024-05-28T08:21:58.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_api.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .route_selection_expression: planned value cty.StringVal("$request.method $request.path") for a non-computed attribute%0A      - .api_key_selection_expression: planned value cty.StringVal("$request.header.x-api-key") for a non-computed attribute%0A2024-05-28T08:21:58.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.event_handler_execution_role, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_detach_policies: planned value cty.False for a non-computed attribute%0A      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.architectures"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.timeout"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.git_branch"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.package_type"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.runtime"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.filepath"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.function_handler"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.publish"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.324Z [INFO]  ReferenceTransformer: reference not found: "var.log_level"%0A2024-05-28T08:21:58.325Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.326Z [INFO]  ReferenceTransformer: reference not found: "var.function_name"%0A2024-05-28T08:21:58.326Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.332Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-28T08:21:58.332Z [INFO]  ReferenceTransformer: reference not found: "var.environment"%0A2024-05-28T08:21:58.335Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_integration.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .payload_format_version: planned value cty.StringVal("1.0") for a non-computed attribute%0A2024-05-28T08:21:58.337Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_apigatewayv2_route.event_handler, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .api_key_required: planned value cty.False for a non-computed attribute%0A      - .authorization_type: planned value cty.StringVal("NONE") for a non-computed attribute%0A2024-05-28T08:21:58.349Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```